result/apache_500.out
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Apache/2.4.29
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /500.html
Document Length:        500 bytes

Concurrency Level:      10000
Time taken for tests:   27.302 seconds
Complete requests:      10000
Failed requests:        117
   (Connect: 0, Receive: 0, Length: 117, Exceptions: 0)
Total transferred:      7619793 bytes
HTML transferred:       4941500 bytes
Requests per second:    366.27 [#/sec] (mean)
Time per request:       27302.283 [ms] (mean)
Time per request:       2.730 [ms] (mean, across all concurrent requests)
Transfer rate:          272.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9  70.7      1    1005
Processing:     2  373 2948.2     10   27250
Waiting:        0   83 1270.7     10   25257
Total:          5  381 2968.8     11   27250

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     12
  80%     12
  90%     12
  95%     13
  98%    271
  99%  24130
 100%  27250 (longest request)