result/libevent_500.out
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8083

Document Path:          /500.html
Document Length:        582 bytes

Concurrency Level:      10000
Time taken for tests:   0.981 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      6440000 bytes
HTML transferred:       5820000 bytes
Requests per second:    10194.16 [#/sec] (mean)
Time per request:       980.954 [ms] (mean)
Time per request:       0.098 [ms] (mean, across all concurrent requests)
Transfer rate:          6411.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      191  267  50.3    261     420
Processing:   210  289  66.5    257     376
Waiting:      162  279  79.6    257     375
Total:        509  556  34.5    569     632

Percentage of the requests served within a certain time (ms)
  50%    569
  66%    583
  75%    589
  80%    592
  90%    597
  95%    601
  98%    614
  99%    622
 100%    632 (longest request)