result/node_500.out
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8082

Document Path:          /500.html
Document Length:        500 bytes

Concurrency Level:      10000
Time taken for tests:   15.084 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      7880000 bytes
HTML transferred:       5000000 bytes
Requests per second:    662.97 [#/sec] (mean)
Time per request:       15083.716 [ms] (mean)
Time per request:       1.508 [ms] (mean, across all concurrent requests)
Transfer rate:          510.17 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  441 494.6     71    1045
Processing:    30  959 2422.3     80   13941
Waiting:       30  959 2422.3     80   13941
Total:         33 1400 2670.4    342   14970

Percentage of the requests served within a certain time (ms)
  50%    342
  66%   1255
  75%   1491
  80%   1872
  90%   4457
  95%   7816
  98%  14721
  99%  14966
 100%  14970 (longest request)