result/socket_500.out
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /500.html
Document Length:        500 bytes

Concurrency Level:      10000
Time taken for tests:   0.654 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      5820000 bytes
HTML transferred:       5000000 bytes
Requests per second:    15282.36 [#/sec] (mean)
Time per request:       654.349 [ms] (mean)
Time per request:       0.065 [ms] (mean, across all concurrent requests)
Transfer rate:          8685.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2  15.1      0     154
Processing:     0    1   0.7      0      16
Waiting:        0    0   0.6      0      16
Total:          0    2  15.4      1     157
WARNING: The median and mean for the processing time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      2
  95%      2
  98%      5
  99%    148
 100%    157 (longest request)