result/tornado_500.out
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        TornadoServer/3.2.1
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /500.html
Document Length:        500 bytes

Concurrency Level:      10000
Time taken for tests:   6.427 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      7410000 bytes
HTML transferred:       5000000 bytes
Requests per second:    1555.93 [#/sec] (mean)
Time per request:       6427.035 [ms] (mean)
Time per request:       0.643 [ms] (mean, across all concurrent requests)
Transfer rate:          1125.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  508 754.4    136    3051
Processing:    37  544 542.5    368    3376
Waiting:       37  544 542.5    368    3376
Total:         39 1052 912.1   1056    6408

Percentage of the requests served within a certain time (ms)
  50%   1056
  66%   1109
  75%   1288
  80%   1411
  90%   1633
  95%   3256
  98%   3938
  99%   4791
 100%   6408 (longest request)